
<policyDefinitionResources revision="1.0" schemaVersion="1.0">

  <displayName>
  </displayName>
  <description>
  </description>

  <resources>
    <stringTable>
      <string id="Name_ECSCommunicationEnabled">Activer la communication et télécharger les expériences</string>
      <string id="Sup_EdgeUpdate1_3_133_3">Microsoft Edge Update 1.3.133.3 et versions ultérieures</string>
      <string id="Part_UninstallEdgePolicy">Désinstaller la stratégie Microsoft Edge</string>
      <string id="Pol_ProxyMode">Choisir comment spécifier les paramètres du serveur proxy</string>
      <string id="Name_ForceInstallsMachine">Forcer les installations (à l’échelle de l’ordinateur)</string>
      <string id="Name_ManualUpdatesOnly">Mises à jour manuelles uniquement</string>
      <string id="Pol_EdgePreview">Autoriser les utilisateurs du programme Windows Insider à s'inscrire à Edge Preview</string>
      <string id="Name_UninstallEdgeDisabled">Désactivé</string>
      <string id="Sup_GoogleUpdate1_3_21_81">Microsoft Edge Update 1.3.21.81 et version ultérieure</string>
      <string id="Explain_Applications">Un modèle ADMX/ADML mis à jour est obligatoire pour prendre en charge les applications Microsoft Edge commercialisées à l’avenir.</string>
      <string id="Name_DesktopShortcutDisabled">Empêcher la création de raccourcis de bureau à l'installation</string>
      <string id="Pol_DefaultRemoveDesktopShortcut">Supprimer les raccourcis bureau à la mise à jour par défaut</string>
      <string id="ProxyFixedServers_DropDown">Utiliser des serveurs de proxy fixes</string>
      <string id="TargetChannel_Dev_DropDown">Développeur</string>
      <string id="Sup_EdgeUpdate1_3_145_1">Microsoft Edge Update 1.3.145.1 et versions ultérieures</string>
      <string id="Pol_ECSControl">Contrôler les communications de l’agent de mise à jour avec le service d’expérimentation et de configuration</string>
      <string id="Explain_ECSControl">Dans la mise à jour de Microsoft Edge, le service d’expérimentation et de configuration est utilisé pour déployer la charge utile d’expérimentation.

La charge utile d’expérimentation correspond à une liste de fonctionnalités en cours de développement que Microsoft met à disposition à des fins de test et de retour d’expérience.

Si vous activez (1) cette stratégie, la charge utile d’expérimentation est téléchargée à partir du service d’expérimentation et de configuration.

Si vous désactivez (0) cette stratégie, la communication avec le service d’expérimentation et de configuration (ECS) est complètement arrêtée.

Si vous ne configurez pas cette stratégie, sur un appareil géré, le comportement est le même que celui de la stratégie « désactivé ».

Si vous ne configurez pas cette stratégie, le comportement de l’appareil non géré sera identique à celui de la stratégie « activé ».</string>
      <string id="Name_InstallsDisabled">Installations désactivées</string>
      <string id="Pol_TargetChannel">Remplacement du canal cible</string>
      <string id="Pol_AllowInstallation">Autoriser l’installation</string>
      <string id="Name_UninstallEdgeEnabledAndDeleteData">Activer et supprimer les données utilisateur</string>
      <string id="Explain_CreateDesktopShortcut">Si vous activez (1) cette stratégie, un raccourci de bureau est créé lors de l'installation de Microsoft Edge.
  Si vous désactivez (0) cette stratégie, aucun raccourci de bureau ne sera créé lors de l'installation de Microsoft Edge.
  Si vous ne configurez pas cette stratégie, un raccourci vers Microsoft Edge est créé sur le Bureau pendant l’installation.
  Si Microsoft Edge est déjà installé, cette stratégie n’a aucun effet.

  Si vous ne configurez pas cette stratégie pour une canal, la configuration de la stratégie « Créer un raccourci de bureau lors de l’installation par défaut » détermine la création de raccourcis lorsque Microsoft Edge est installé.</string>
      <string id="Sup_EdgeUpdate1_3_119_43">Microsoft Edge Update 1.3.119.43 et versions ultérieures</string>
      <string id="Pol_AllowSideBySideExperience">Autoriser l'expérience utilisateur du navigateur Microsoft Edge côte à côte</string>
      <string id="Explain_AutoUpdateCheckPeriod">Nombre minimum de minutes entre les vérifications automatiques des mises à jour.

Définissez cette stratégie sur la valeur 0 pour désactiver tout trafic réseau périodique par Microsoft Edge Update. Cette opération n’est pas recommandée, car elle empêche Microsoft Edge Update de recevoir des mises à jour de stabilité et de sécurité.

Les paramètres « Remplacement de stratégie de mise à jour par défaut » et « Remplacement de stratégie de mise à jour » par application plutôt que ce paramètre.tre.

Les valeurs de cette stratégie peuvent être comprises entre 0 et 43200.</string>
      <string id="TargetChannel_Extended_Stable_DropDown">Stable étendu</string>
      <string id="Sup_EdgeUpdate1_3_195_63">Microsoft Edge Update 1.3.195.63 et versions ultérieures</string>
      <string id="Explain_DefaultUpdatePolicy">Vous permet de spécifier le comportement par défaut de tous les canaux concernant la façon dont Microsoft Edge Update gère les mises à jour disponibles pour Microsoft Edge. Peut être remplacé par des canaux individuels en spécifiant la stratégie « Remplacement de la stratégie de mise à jour » pour ces canaux spécifiques.

Si vous activez cette stratégie, Microsoft Edge Update gère les mises à jour de Microsoft Edge en fonction de la configuration des options suivantes :
  - Mises à jour désactivées (0) : les mises à jour ne sont jamais appliquées.
  - Toujours autoriser les mises à jour (1) (recommandé) : les mises à jour sont toujours appliquées lorsqu'elles sont trouvées, soit par un contrôle périodique des mises à jour, soit par un contrôle manuel des mises à jour.
  - Mises à jour manuelles uniquement (2) :les mises à jour ne sont appliquées que lorsque l'utilisateur effectue une vérification manuelle des mises à jour.
  - Mises à jour automatiques silencieuses uniquement (3) : Les mises à jour ne sont appliquées que lorsqu'elles sont détectées par la vérification périodique des mises à jour.

Si vous sélectionnez des mises à jour manuelles, assurez-vous de vérifier régulièrement les mises à jour en utilisant le mécanisme de mise à jour manuelle de l’application, s’il est disponible. Si vous désactivez les mises à jour, vérifiez régulièrement les mises à jour et distribuez-les aux utilisateurs.

Si vous n’activez pas et ne configurez pas cette stratégie, Microsoft Edge Update gère les mises à jour disponibles comme spécifié par la stratégie « Remplacement de la stratégie de mise à jour ».

Cette stratégie n’est disponible que sur les instances Windows qui sont reliées à un domaine Microsoft® Active Directory®.</string>
      <string id="Explain_WebView_AutoUpdate">Permet d'indiquer si les mises à jour automatiques sont activées ou non pour le Runtime WebView2. Le Runtime WebView2 est un composant utilisé par les applications pour afficher du contenu Web.
  Les mises à jour automatiques sont activées par défaut. La désactivation des mises à jour automatiques pour le Runtime WebView2 peut entraîner des problèmes de compatibilité avec les applications qui dépendent de ce composant.

  Si vous activez cette stratégie, Microsoft Edge Update gère les mises à jour de WebView2 Runtime en fonction de la façon dont vous configurez les options suivantes :
  - Toujours autoriser les mises à jour (1) : les mises à jour sont automatiquement téléchargées et appliquées
  - Mises à jour désactivées (0) : les mises à jour ne sont jamais téléchargées ou appliquées

  Si vous n'activez pas cette stratégie, les mises à jour sont automatiquement téléchargées et appliquées.</string>
      <string id="Sup_GoogleUpdate1_3_34_3">Microsoft Edge Update 1.3.34.3 et version ultérieure</string>
      <string id="Name_MeteredUpdatesEnabled">Mises à jour limitées autorisées</string>
      <string id="ProxyAutoDetect_DropDown">Détection automatique des paramètres de proxy</string>
      <string id="ProxyPacScript_DropDown">Utiliser un script de proxy .pac</string>
      <string id="Sup_EdgeUpdate1_3_179_5">Microsoft Edge Update 1.3.179.5 et versions ultérieures</string>
      <string id="DownloadPreference_DropDown">URL de téléchargement pouvant être mises en cache</string>
      <string id="Name_ForceInstallsUser">Forcer les installations (par utilisateur)</string>
      <string id="Explain_AllowSideBySideExperience">Cette stratégie permet à un utilisateur d’exécuter côte à côte Microsoft Edge (Edge HTML) et Microsoft Edge (basé sur Chromium).

Si cette stratégie est définie sur “Non configurée”, Microsoft Edge (basé sur Chromium) remplacera Microsoft Edge (Edge HTML) après l’installation du canal stable Microsoft Edge (basé sur Chromium) et des mises à jour de sécurité de novembre 2019.  Ce comportement est identique à celui du paramètre « Désactivé ».

Le paramètre « Désactivé » (0) bloque une expérience côte à côte et Microsoft Edge (basé sur Chromium) remplacera Microsoft Edge (Edge HTML) après l’installation du canal stable de Microsoft Edge (basé sur Chromium) et des mises à jour de sécurité de novembre 2019.  Ce comportement est identique à celui du paramètre « Non configuré ».

Lorsque cette stratégie est « Activée » (1), Microsoft Edge (basé sur Chromium) et Microsoft Edge (Edge HTML) peuvent s’exécuter côte à côte après l’installation de Microsoft Edge (basé sur Chromium).

Pour que cette stratégie de groupe prenne effet, elle doit être configurée avant l’installation automatique de Microsoft Edge (basé sur Chromium) par Windows Update. Remarque : Un utilisateur peut bloquer la mise à jour automatique de Microsoft Edge (basé sur Chromium) en utilisant le kit de ressources de blocage (Blocker Toolkit) de Microsoft Edge (basé sur Chromium).

À partir de la version 20H2 de Windows 10, l’Ancienne version de Microsoft Edge et l’expérience de navigation côte à côte ne sont pas pris en charge.</string>
      <string id="Explain_RemoveDesktopShortcut">Si vous définissez cette stratégie sur « Forcer la suppression des raccourcis de bureau au niveau du système » (1), tous les raccourcis de bureau Microsoft Edge existants au niveau du système seront supprimés lors de la mise à jour du navigateur ou du redémarrage de l'ordinateur.
  Si vous définissez cette stratégie sur « Forcer la suppression des raccourcis de bureau au niveau du système et au niveau de l'utilisateur » (2), tous les raccourcis de bureau Microsoft Edge existants au niveau du système seront supprimés lors de la mise à jour du navigateur ou du redémarrage de l'ordinateur et tous les raccourcis de bureau existants au niveau de l'utilisateur seront supprimés lors de la mise à jour du navigateur. Cela inclut les raccourcis bureau au niveau de l’utilisateur que les utilisateurs ont pu se faire eux-mêmes.
  Si vous ne configurez pas cette stratégie ou si vous la désactivez (0), rien ne se passera pour les raccourcis de bureau Microsoft Edge existants.

  Si vous ne configurez pas cette stratégie pour un canal, la configuration de la stratégie "Supprimer les raccourcis bureau à la mise à jour par défaut" détermine la suppression des raccourcis du bureau.</string>
      <string id="ProxyDisabled_DropDown">Ne jamais utiliser un proxy</string>
      <string id="Pol_DefaultAllowInstallation">Autoriser l’installation par défaut</string>
      <string id="Pol_ProxyPacUrl">URL vers un fichier .pac de proxy</string>
      <string id="Cat_Applications">Applications</string>
      <string id="Explain_ProxyPacUrl">Vous permet de spécifier une URL pour un fichier de configuration automatique de proxy (PAC).

  Si vous activez ce paramètre de stratégie, vous pouvez spécifier une URL pour un fichier PAC afin d’automatiser la façon dont Microsoft Edge Update sélectionne le serveur proxy approprié pour l’extraction d’un site web particulier.

  Cette stratégie est appliquée uniquement si vous avez spécifié des paramètres de proxy manuels dans la stratégie « Choisir comment spécifier les paramètres d’un serveur proxy ».

Ne configurez pas cette stratégie si vous avez sélectionné un paramètre de proxy autre que manuel dans la stratégie « Choisir comment spécifier les paramètres d’un serveur proxy ».</string>
      <string id="Sup_EdgeUpdate1_3_193_5">Microsoft Edge Update 1.3.193.5 et versions ultérieures</string>
      <string id="TargetChannel_Beta_DropDown">Version bêta</string>
      <string id="Sup_EdgeUpdate1_3_168_21">Microsoft Edge Update 1.3.168.21 et versions ultérieures</string>
      <string id="Explain_Preferences">Stratégies générales pour Microsoft Edge Update.</string>
      <string id="Explain_WebView">Stratégies Specfies pour le runtime WebView2</string>
      <string id="Name_DefaultMeteredUpdatesDisabled">Mises à jour limitées par défaut désactivées</string>
      <string id="Sup_EdgeUpdate1_3_127_1">Microsoft Edge Update 1.3.127.1 et versions ultérieures</string>
      <string id="Explain_ProxyServer">Vous permet de spécifier l’URL du serveur proxy que Microsoft Edge Update doit utiliser.

  Si vous activez ce paramètre de stratégie, vous pouvez définir l’URL de serveur proxy utilisée par la mise à jour de Microsoft Edge dans votre organisation.

  Cette stratégie est appliquée uniquement si vous avez sélectionné les paramètres de proxy manuels dans la stratégie « Choisir comment spécifier les paramètres d’un serveur proxy ».

  Ne configurez pas cette stratégie si vous avez sélectionné un paramètre de proxy autre que manuel dans la stratégie « Choisir comment spécifier les paramètres d’un serveur proxy ».</string>
      <string id="Pol_MeteredUpdates">Permettre aux utilisateurs de mettre à jour les connexions limitées</string>
      <string id="Name_UninstallEdgeNotConfigured">Non configuré</string>
      <string id="Explain_DefaultAllowInstallation">Vous pouvez déterminer le comportement par défaut de tous les canaux pour autoriser ou pour bloquer les mises à jour de Microsoft Edge sur les appareils joints au domaine.

Vous pouvez remplacer cette stratégie pour des canaux individuels en activant (1) la stratégie « Autoriser l’installation » pour des canaux spécifiques.

Si vous désactivez (2) cette stratégie, l’installation de Microsoft Edge est bloquée. Cette modification n’affecte l’installation du logiciel Microsoft Edge que lorsque la stratégie « Autoriser l’installation » est définie sur Non configurée.

Cette stratégie n'empêche pas l'exécution de la mise à jour de Microsoft Edge ni l'installation du logiciel Microsoft Edge par d'autres méthodes.

Cette stratégie n’est disponible que sur les instances Windows qui sont reliées à un domaine Microsoft® Active Directory®.</string>
      <string id="Sup_EdgeUpdate1_3_155_1">Microsoft Edge Update 1.3.155.1 et versions ultérieures</string>
      <string id="TargetChannel_Stable_DropDown">Stable</string>
      <string id="Cat_Google">Microsoft</string>
      <string id="Pol_DefaultUpdatePolicy">Remplacement de la stratégie de mise à jour par défaut</string>
      <string id="Explain_ProxyMode">Vous permet de spécifier les paramètres de serveur proxy utilisés par Microsoft Edge Update.

  Si vous activez ce paramètre de stratégie, vous pouvez choisir l’une des options de serveur proxy suivantes :
   -Si vous choisissez de ne jamais utiliser de serveur proxy et de toujours vous connecter directement, toutes les autres options sont ignorées.
   -Si vous choisissez d’utiliser les paramètres de proxy système ou de détecter automatiquement le serveur proxy, toutes les autres options sont ignorées.
   -Si vous choisissez le mode proxy de serveur fixe, vous pouvez spécifier d’autres options dans la stratégie « Adresse ou URL d’un serveur proxy ».
   -Si vous choisissez d’utiliser un script de proxy. PAC, vous devez spécifier l’URL du script dans la stratégie « URL du fichier .pac du proxy ».

  Si vous activez ce paramètre de stratégie, les utilisateurs de votre organisation ne peuvent pas modifier les paramètres de proxy dans Microsoft Edge Update.

  Si vous désactivez ce paramètre de stratégie ou si vous ne le configurez pas, aucun paramètre de serveur proxy n’est configuré, mais les utilisateurs au sein de votre organisation peuvent choisir leurs propres paramètres de proxy pour Microsoft Edge Update.</string>
      <string id="Name_UninstallEdgeEnabledAndKeepData">Activé</string>
      <string id="Sup_GoogleUpdate1_3_26_0">Microsoft Edge Update 1.3.26.0 et version ultérieure</string>
      <string id="Pol_RemoveDesktopShortcut">Supprimer les raccourcis du Bureau lors de la mise à jour</string>
      <string id="Sup_EdgeUpdate1_3_147_1">Microsoft Edge Update 1.3.147.1 et versions ultérieures</string>
      <string id="Name_UpdatesDisabled">Mises à jour désactivées</string>
      <string id="Pol_RollbackToTargetVersion">Restaurer vers la version cible</string>
      <string id="Explain_WebView_Install">Vous permet de spécifier si le Runtime WebView2 peut être installé en utilisant Microsoft Edge Update.

  Si vous activez (1) cette stratégie, les utilisateurs peuvent installer le moteur d'exécution WebView2 via Microsoft Edge Update.

  Si vous désactivez (0) cette stratégie (ou si vous lui attribuez la valeur "Installations désactivées"), les utilisateurs ne peuvent pas installer le moteur d'exécution WebView2 par l'intermédiaire de Microsoft Edge Update.

  Si vous définissez cette politique sur Toujours autoriser les installations à l'échelle de la machine mais pas les installations par utilisateur (4), le Runtime WebView2 ne sera déployé qu'à l'échelle de la machine.

  Si vous définissez la stratégie sur Forcer les installations (à l'échelle de la machine) (5), les utilisateurs peuvent installer le moteur d'exécution WebView2 sur toutes les machines sur lesquelles Microsoft Edge Update est préinstallé. Nécessite Microsoft Edge Update 1.3.155.43 ou une version plus récente.

  Si vous ne configurez pas cette stratégie, le Runtime WebView2 sera installé via Microsoft Edge Update.</string>
      <string id="Explain_GoogleUpdate">Stratégies de contrôle de l’installation et de la mise à jour de Microsoft Edge à l’aide de Microsoft Edge Update.</string>
      <string id="Name_EdgePreviewEnrollmentTypeAllowOptOut">Autoriser le refus</string>
      <string id="Explain_DefaultRemoveDesktopShortcut">Permet de spécifier le comportement par défaut de tous les canaux pour la création d'un raccourci sur le bureau lorsque Microsoft Edge est installé.

  Si vous définissez cette stratégie sur « Forcer la suppression des raccourcis de bureau au niveau du système » (1), tous les raccourcis de bureau Microsoft Edge existants au niveau du système seront supprimés lors de la mise à jour du navigateur ou du redémarrage de l'ordinateur.
  Si vous définissez cette stratégie sur « Forcer la suppression des raccourcis de bureau au niveau du système et au niveau de l'utilisateur » (2), tous les raccourcis de bureau Microsoft Edge existants au niveau du système seront supprimés lors de la mise à jour du navigateur ou du redémarrage de l'ordinateur et tous les raccourcis de bureau existants au niveau de l'utilisateur seront supprimés lors de la mise à jour du navigateur. Cela inclut les raccourcis bureau au niveau de l’utilisateur que les utilisateurs ont pu se faire eux-mêmes.
  Si vous ne configurez pas cette stratégie ou si vous la désactivez (0), rien ne se passera pour les raccourcis de bureau Microsoft Edge existants.</string>
      <string id="Explain_UpdateCheckSuppressedPeriod">Si vous activez cette stratégie, les vérifications de mise à jour sont supprimées chaque jour à partir de Hour :Minute pour une période de durée (en minutes). La durée n’est pas affectée par l’heure d’été. Par exemple, si l’heure de début est 22 :00 et que la durée est de 480 minutes, les mises à jour sont supprimées pendant exactement 8 heures, que l’heure d’été démarre ou se termine pendant cette période.

Si vous désactivez ou ne configurez pas cette stratégie, les vérifications de mise à jour ne sont pas supprimées pendant une période spécifique.

Les valeurs de cette stratégie peuvent être comprises entre 0 et 23 pour les heures, de 0 à 59 pour les minutes et de 0 à 960 pour la durée en minutes.</string>
      <string id="Name_UpdatesEnabled">Toujours autoriser les mises à jour (recommandé)</string>
      <string id="Cat_ProxyServer">Serveur proxy</string>
      <string id="Pol_CreateDesktopShortcut">Créer un raccourci de bureau lors de l’installation</string>
      <string id="Pol_AutoUpdateCheckPeriod">Remplacement de la période de vérification de mise à jour automatique</string>
      <string id="Sup_GoogleUpdate1_2_145_5">Microsoft Edge Update 1.2.145.5 et version ultérieure</string>
      <string id="Pol_DefaultCreateDesktopShortcut">Créer un raccourci de bureau lors de l’installation par défaut</string>
      <string id="Name_DeleteSystemDesktopShortcuts">Forcer la suppression des raccourcis bureau au niveau du système</string>
      <string id="Name_ECSCommunicationDisabled">Désactiver la communication avec le service d’expérimentation et de configuration</string>
      <string id="Sup_GoogleUpdate1_3_33_5">Microsoft Edge Update 1.3.33.5 et version ultérieure</string>
      <string id="Name_InstallsEnabled">Toujours autoriser les installations (recommandé)</string>
      <string id="Explain_DownloadPreference">Si cette option est activée, le serveur Microsoft Edge Update tente de fournir des URL conviviales du cache pour les charges utiles de mise à jour dans ses réponses.</string>
      <string id="Name_AutomaticUpdatesOnly">Mises à jour automatiques silencieuses uniquement</string>
      <string id="Pol_DefaultMeteredUpdates">Autoriser les utilisateurs à mettre à jour toutes les applications sur des connexions limitées</string>
      <string id="Name_DefaultMeteredUpdatesEnabled">Mises à jour limitées par défaut autorisées</string>
      <string id="Pol_TargetVersionPrefix">Remplacement de la version cible</string>
      <string id="Pol_UninstallEdge">Spécifier le comportement de désinstallation pour Microsoft Edge</string>
      <string id="Name_MeteredUpdatesDisabled">Désactiver les mises à jour limitées</string>
      <string id="Name_EdgePreviewEnrollmentTypeRequired">Obligatoire</string>
      <string id="Pol_DownloadPreference">Remplacement de la classe d'URL de téléchargement</string>
      <string id="Pol_UpdateCheckSuppressedPeriod">Période de la journée pendant laquelle supprimer la vérification de mise à jour automatique</string>
      <string id="Sup_EdgeUpdate1_3_128_0">Microsoft Edge Update 1.3.128.0 et versions ultérieures</string>
      <string id="Cat_WebView">Microsoft Edge WebView2 Runtime</string>
      <string id="Pol_UpdatePolicy">Remplacement de la stratégie de mise à jour</string>
      <string id="Pol_EdgePreviewEnrollmentType">Type d’inscription Edge Preview</string>
      <string id="Pol_ProxyServer">Adresse ou URL du serveur proxy</string>
      <string id="Explain_DefaultCreateDesktopShortcut">Permet de spécifier le comportement par défaut de tous les canaux pour la création d'un raccourci sur le bureau lorsque Microsoft Edge est installé.

  Si vous activez (1) cette stratégie, un raccourci de bureau est créé lors de l'installation de Microsoft Edge.
  Si vous désactivez (0) cette stratégie, aucun raccourci de bureau ne sera créé lors de l'installation de Microsoft Edge.
  Si vous ne configurez pas cette stratégie, un raccourci vers Microsoft Edge est créé sur le Bureau pendant l’installation.
  Si Microsoft Edge est déjà installé, cette stratégie n’a aucun effet.</string>
      <string id="Name_DeleteAllDesktopShortcuts">Forcer la suppression des raccourcis Bureau au niveau du système et de l’utilisateur</string>
      <string id="ProxyUseSystem_DropDown">Utiliser les paramètres proxy du système</string>
      <string id="Cat_Preferences">Préférences</string>
      <string id="Name_InstallsEnabledMachineOnly">Autorisez toujours les installations à l’échelle de l’ordinateur, mais pas par utilisateur.</string>
      <string id="Cat_GoogleUpdate">Mise à jour de Microsoft Edge</string>
      <string id="Explain_DefaultMeteredUpdatesPolicy">Spécifie si la mise à jour de Microsoft Edge doit être effectuée sur les connexions identifiées comme limitées, telles que les connexions cellulaires ou d’autres connexions pour lesquelles l’utilisation des données est contrôlée pour toutes les applications. 

Si vous n’activez pas et ne configurez pas cette stratégie, les mises à jour sont effectuées selon la bascule « Télécharger les mises à jour sur les connexions payantes » dans la page « À propos » du navigateur Microsoft Edge. Si l’utilisateur ne fait pas de choix, c’est le paramètre de Windows qui est utilisé. Pour en savoir plus sur les paramètres de Windows, cliquez ici : https://learn.microsoft.com/en-us/windows/client-management/mdm/policy-csp-update#allowautowindowsupdatedownloadovermeterednetwork

Toujours autoriser les mises à jour (2) : Les mises à jour sont toujours téléchargées lorsqu’elles sont détectées, soit par un contrôle automatique des mises à jour, soit par un contrôle manuel des mises à jour.

Mises à jour désactivées (1) : Les mises à jour ne sont pas téléchargées lors de l’utilisation d’une connexion limitée.</string>
      <string id="Cat_MicrosoftEdge">Microsoft Edge</string>
      <string id="Explain_InstallMicrosoftEdge">Spécifie si un canal Microsoft Edge peut être installé sur des appareils joints à un domaine.

  Si vous activez (1) cette stratégie pour un canal, l’installation de Microsoft Edge ne sera pas bloquée.

  Si vous désactivez (0) cette stratégie pour un canal (ou la définissez sur « Installations désactivées »), Microsoft Edge ne sera pas installée.

  Si vous ne configurez pas cette stratégie pour un canal, la configuration de stratégie « Autoriser l’installation par défaut » détermine si les utilisateurs peuvent installer ce canal de Microsoft Edge.

Si vous définissez cette stratégie sur Toujours autoriser les installations Machine-Wide mais pas les installations Per-User (4), « APP_NAME » est déployé uniquement à l’échelle de l’ordinateur.

Si vous définissez cette stratégie sur Forcer les installations (à l'échelle de la machine) (5), « APP_NAME » ne peut être déployé à l'échelle de la machine que si Microsoft Edge Update est préinstallé. Nécessite Microsoft Edge Update 1.3.155.43 ou une version plus récente.

Si vous définissez cette stratégie sur Forcer les installations (par utilisateur) (6), « APP_NAME » peut n’être déployé que sur une base par utilisateur sur toutes les machines si Microsoft Edge Update est préinstallé par utilisateur. Nécessite Microsoft Edge Update 1.3.155.43 ou une version plus récente.

Cette stratégie n’est disponible que sur les instances Windows jointes à un domaine Microsoft® Active Directory®.</string>
      <string id="Explain_AutoUpdateMicrosoftEdge">Spécifie la façon dont Microsoft Edge Update gère les mises à jour disponibles à partir de Microsoft Edge.

Si vous activez cette stratégie, Microsoft Edge Update gère les mises à jour de Microsoft Edge en fonction de la configuration des options suivantes :
  - Mises à jour désactivées (0) : les mises à jour ne sont jamais appliquées.
  - Toujours autoriser les mises à jour (1) (Recommandé) : les mises à jour sont toujours appliquées lorsqu'elles sont trouvées, soit par un contrôle périodique des mises à jour, soit par un contrôle manuel des mises à jour.
  - Mises à jour manuelles uniquement (2) :les mises à jour ne sont appliquées que lorsque l'utilisateur effectue une vérification manuelle des mises à jour. (Toutes les applications ne proposent pas d’interface pour cette option.)
  - Mises à jour automatiques silencieuses uniquement (3) : Les mises à jour ne sont appliquées que lorsqu'elles sont détectées par la vérification périodique des mises à jour.

Si vous sélectionnez des mises à jour manuelles, assurez-vous de vérifier régulièrement les mises à jour en utilisant le mécanisme de mise à jour manuelle de l’application, s’il est disponible. Si vous désactivez les mises à jour, vérifiez régulièrement les mises à jour et distribuez-les aux utilisateurs.

Si vous n’activez pas et ne configurez pas cette stratégie, Microsoft Edge Update gère les mises à jour disponibles comme spécifié par la stratégie « Remplacement de la stratégie de mise à jour par défaut ».

Consultez https://go.microsoft.com/fwlink/?linkid=2136406 si vous souhaitez obtenir plus d’informations.

Cette stratégie n’est disponible que sur les instances Windows qui sont reliées à un domaine Microsoft® Active Directory®.</string>
      <string id="Explain_TargetChannelMicrosoftEdge">Spécifie le canal de mise à jour de Microsoft Edge

Cette stratégie contrôle le canal de mise à jour que Microsoft Edge suivra.

Si vous activez cette stratégie, Microsoft Edge sera mis à jour vers le canal que vous configurez :
- Stable : mis à jour vers la dernière version stable.
- Bêta : mis à jour vers la dernière version bêta.
- Développeur : mis à jour vers la dernière version de développement.
– Stable étendu : mis à jour vers la dernière version stable étendue, qui suit une cadence de mise en production plus longue que stable. Pour plus d’informations, consultez https://go.microsoft.com/fwlink/?linkid=2163508.

Si vous désactivez ou ne configurez pas cette stratégie, Microsoft Edge se mettra à jour vers la dernière version disponible pour le canal par défaut.

Cette stratégie n’est prise en charge que sur les appareils Windows qui sont reliées à un domaine Microsoft® Active Directory®.</string>
      <string id="Explain_TargetVersionPrefixMicrosoftEdge">Lorsque cette stratégie est activée et que la mise à jour automatique est activée,Microsoft Edge est mis à jour vers la version spécifiée par cette valeur de stratégie.

La valeur de la stratégie doit être une version spécifique de Microsoft Edge, par exemple, 83.0.499.12.

Si la version Microsoft Edge d’un appareil est plus récente que la valeur spécifiée, Microsoft Edge demeure sur la version la plus récente et ne rétrograde pas vers la version spécifiée.

Si la version spécifiée n’existe pas ou n’est pas correctement mise en forme, Microsoft Edge reste sur sa version actuelle et n’est pas mis à jour automatiquement vers les versions ultérieures.

Consultez https://go.microsoft.com/fwlink/?linkid=2136707 si vous souhaitez obtenir plus d’informations.

Cette stratégie est uniquement disponible sur les instances Windows qui sont jointes à un domaine Microsoft® Active Directory®.</string>
      <string id="Explain_RollbackToTargetVersionMicrosoftEdge">Spécifie que la mise à jour de Microsoft Edge doit rétablir les installations de Microsoft Edge vers la version indiquée dans « Remplacement de la version cible ».

Cette stratégie n’a aucun effet, sauf si « Remplacement de la version cible » est défini et que « Remplacement de la stratégie de mise à jour » est configuré sur l’un des états ACTIVÉ (Toujours autoriser les mises à jour, Mises à jour silencieuses automatiques uniquement, Mises à jour manuelles uniquement).

Si vous désactivez (0) cette stratégie ou ne la configurez pas, les installations dont la version est supérieure à celle spécifiée par « Remplacement de la version cible » sont conservées.

Si vous activez (1) cette stratégie, les installations dont la version actuelle est supérieure à celle spécifiée par « Remplacement de la version cible » seront rétrogradées à la version cible.

Nous recommandons aux utilisateurs d’installer la dernière version du navigateur Microsoft Edge afin d’être protégés par les dernières mises à jour de sécurité. La restauration vers une version antérieure représente un risque d’exposition aux problèmes de sécurité connus. Cette stratégie est destinée à être utilisée comme correctif temporaire pour résoudre les problèmes rencontrés dans une mise à jour du navigateur Microsoft Edge.

Avant de restaurer temporairement la version de votre navigateur, nous vous recommandons d’activer la synchronisation (https://go.microsoft.com/fwlink/?linkid=2133032) pour tous les utilisateurs de votre organisation. Si vous n’activez pas la synchronisation, vous risquez de perdre définitivement des données de navigation. Vous assumez donc les risques liés à l’utilisation de cette stratégie.

Note : Toutes les versions disponibles pour la restauration peuvent être consultées ici https://aka.ms/EdgeEnterprise.

Cette stratégie s’applique à la version 86 ou ultérieure de Microsoft Edge.

Pour plus d’informations, consultez l’https://go.microsoft.com/fwlink/?linkid=2133918.

Cette stratégie n’est disponible que sur les instances Windows qui sont reliées à un domaine Microsoft® Active Directory®.</string>
      <string id="Explain_EdgePolicyMicrosoftEdge">Vous permet de spécifier si les utilisateurs du Programme Windows Insider sont inscrits à Edge Preview via Microsoft Edge Update.

  - Si vous activez (1) cette stratégie, les utilisateurs du programme Windows Insider sont inscrits à Edge Preview via Microsoft Edge Update.

  - Si vous désactivez (0) cette stratégie, les utilisateurs du programme Windows Insider ne peuvent pas être inscrits à Edge Preview via Microsoft Edge Update.

  – Si vous ne configurez pas cette stratégie, les utilisateurs du Programme Windows Insider sont inscrits à Edge Preview via Microsoft Edge Update par défaut.</string>
      <string id="Explain_EdgePreviewEnrollmentTypeMicrosoftEdge">Les détails de cette stratégie seront disponibles dans une prochaine version</string>
      <string id="Explain_MeteredUpdatesPolicyMicrosoftEdge">Spécifie si la mise à jour de Microsoft Edge doit être effectuée sur les connexions identifiées comme limitées, telles que les connexions cellulaires ou d’autres connexions où l’utilisation des données est contrôlée pour le navigateur Microsoft Edge. 

Si vous n’activez pas et ne configurez pas cette stratégie, les mises à jour sont effectuées selon la bascule « Télécharger les mises à jour sur les connexions payantes » dans la page « À propos » du navigateur Microsoft Edge. Si l’utilisateur ne fait pas de choix, c’est le paramètre de Windows qui est utilisé. Pour en savoir plus sur les paramètres de Windows, cliquez ici : https://learn.microsoft.com/en-us/windows/client-management/mdm/policy-csp-update#allowautowindowsupdatedownloadovermeterednetwork

Toujours autoriser les mises à jour (2) : Les mises à jour sont toujours téléchargées lorsqu’elles sont détectées, soit par un contrôle automatique des mises à jour, soit par un contrôle manuel des mises à jour.

Désactiver les mises à jour (1) : Les mises à jour ne sont pas téléchargées lors de l’utilisation d’une connexion limitée.</string>
      <string id="Explain_UninstallEdgeMicrosoftEdge">Vous pouvez spécifier si Microsoft Edge (canal stable) est désinstallé ou s’il ne peut pas être désinstallé, sur les appareils joints à un domaine dans l’Espace économique européen (EEA).

Si cette stratégie est définie sur « Activé », Microsoft Edge est automatiquement désinstallé sur tous les appareils dans l’EEA où cette stratégie est déployée. Les données utilisateur seront conservées sur l’appareil. Microsoft Edge sera désinstallé la prochaine fois que Microsoft Edge Update recherchera automatiquement des mises à jour. Si Microsoft Edge est désinstallé des appareils, les applications, widgets (par exemple, Actualités, Recherche et Météo) ou toute autre application web progressive (PWA) qui dépend de Microsoft Edge ne seront plus disponibles.

Si cette stratégie est définie sur « Activé et supprimer des données utilisateur » (paramètre « 2 »), Microsoft Edge est automatiquement désinstallé sur tous les appareils dans l’EEA où cette stratégie est déployée et les données utilisateur sont supprimées de l’appareil.

Si cette stratégie est définie sur « Désactivé » (paramètre « 3 »), aucun utilisateur dans l’EEA ne pourra désinstaller Microsoft Edge où cette stratégie est déployée.

Si la stratégie est « Non configuré » (paramètre par défaut), le paramètre de région Windows d’un utilisateur détermine s’il peut désinstaller Microsoft Edge sur un appareil joint à un domaine. Seuls les utilisateurs des pays de l’EEA pourront désinstaller Microsoft Edge s’ils le souhaitent. Les utilisateurs extérieurs à cette zone ne pourront pas désinstaller Microsoft Edge.

Cette stratégie est disponible uniquement sur les éditions Windows Home, Pro, Pro Éducation, Pro pour Stations de travail, Enterprise, Éducation et Enterprise multi-session de Windows 10 22H2, Windows 11 23H2 et versions ultérieures.

Cette stratégie n’est disponible que sur les instances Windows qui sont reliées à un domaine Microsoft® Active Directory®.

Si Microsoft Edge doit être réinstallé :
– Vous pouvez définir la stratégie « Installer » sur Forcer les installations (à l’échelle de l’ordinateur) à réinstaller Microsoft Edge.
– Si vous définissez la stratégie d’installation sur Forcer les installations (à l’échelle de l’ordinateur) et si vous définissez également la stratégie de désinstallation sur Activé, la stratégie Forcer les installations (à l’échelle de l’ordinateur) remplace la stratégie de désinstallation.</string>
      <string id="Cat_MicrosoftEdgeBeta">Microsoft Edge Beta</string>
      <string id="Explain_InstallMicrosoftEdgeBeta">Spécifie si un canal Microsoft Edge peut être installé sur des appareils joints à un domaine.

  Si vous activez (1) cette stratégie pour un canal, l’installation de Microsoft Edge ne sera pas bloquée.

  Si vous désactivez (0) cette stratégie pour un canal (ou la définissez sur « Installations désactivées »), Microsoft Edge ne sera pas installée.

  Si vous ne configurez pas cette stratégie pour un canal, la configuration de stratégie « Autoriser l’installation par défaut » détermine si les utilisateurs peuvent installer ce canal de Microsoft Edge.

Si vous définissez cette stratégie sur Toujours autoriser les installations Machine-Wide mais pas les installations Per-User (4), « APP_NAME » est déployé uniquement à l’échelle de l’ordinateur.

Si vous définissez cette stratégie sur Forcer les installations (à l'échelle de la machine) (5), « APP_NAME » ne peut être déployé à l'échelle de la machine que si Microsoft Edge Update est préinstallé. Nécessite Microsoft Edge Update 1.3.155.43 ou une version plus récente.

Si vous définissez cette stratégie sur Forcer les installations (par utilisateur) (6), « APP_NAME » peut n’être déployé que sur une base par utilisateur sur toutes les machines si Microsoft Edge Update est préinstallé par utilisateur. Nécessite Microsoft Edge Update 1.3.155.43 ou une version plus récente.

Cette stratégie n’est disponible que sur les instances Windows jointes à un domaine Microsoft® Active Directory®.</string>
      <string id="Explain_AutoUpdateMicrosoftEdgeBeta">Spécifie la façon dont Microsoft Edge Update gère les mises à jour disponibles à partir de Microsoft Edge.

Si vous activez cette stratégie, Microsoft Edge Update gère les mises à jour de Microsoft Edge en fonction de la configuration des options suivantes :
  - Mises à jour désactivées (0) : les mises à jour ne sont jamais appliquées.
  - Toujours autoriser les mises à jour (1) (Recommandé) : les mises à jour sont toujours appliquées lorsqu'elles sont trouvées, soit par un contrôle périodique des mises à jour, soit par un contrôle manuel des mises à jour.
  - Mises à jour manuelles uniquement (2) :les mises à jour ne sont appliquées que lorsque l'utilisateur effectue une vérification manuelle des mises à jour. (Toutes les applications ne proposent pas d’interface pour cette option.)
  - Mises à jour automatiques silencieuses uniquement (3) : Les mises à jour ne sont appliquées que lorsqu'elles sont détectées par la vérification périodique des mises à jour.

Si vous sélectionnez des mises à jour manuelles, assurez-vous de vérifier régulièrement les mises à jour en utilisant le mécanisme de mise à jour manuelle de l’application, s’il est disponible. Si vous désactivez les mises à jour, vérifiez régulièrement les mises à jour et distribuez-les aux utilisateurs.

Si vous n’activez pas et ne configurez pas cette stratégie, Microsoft Edge Update gère les mises à jour disponibles comme spécifié par la stratégie « Remplacement de la stratégie de mise à jour par défaut ».

Consultez https://go.microsoft.com/fwlink/?linkid=2136406 si vous souhaitez obtenir plus d’informations.

Cette stratégie n’est disponible que sur les instances Windows qui sont reliées à un domaine Microsoft® Active Directory®.</string>
      <string id="Explain_TargetChannelMicrosoftEdgeBeta">Spécifie le canal de mise à jour de Microsoft Edge

Cette stratégie contrôle le canal de mise à jour que Microsoft Edge suivra.

Si vous activez cette stratégie, Microsoft Edge sera mis à jour vers le canal que vous configurez :
- Stable : mis à jour vers la dernière version stable.
- Bêta : mis à jour vers la dernière version bêta.
- Développeur : mis à jour vers la dernière version de développement.
– Stable étendu : mis à jour vers la dernière version stable étendue, qui suit une cadence de mise en production plus longue que stable. Pour plus d’informations, consultez https://go.microsoft.com/fwlink/?linkid=2163508.

Si vous désactivez ou ne configurez pas cette stratégie, Microsoft Edge se mettra à jour vers la dernière version disponible pour le canal par défaut.

Cette stratégie n’est prise en charge que sur les appareils Windows qui sont reliées à un domaine Microsoft® Active Directory®.</string>
      <string id="Explain_TargetVersionPrefixMicrosoftEdgeBeta">Lorsque cette stratégie est activée et que la mise à jour automatique est activée,Microsoft Edge est mis à jour vers la version spécifiée par cette valeur de stratégie.

La valeur de la stratégie doit être une version spécifique de Microsoft Edge, par exemple, 83.0.499.12.

Si la version Microsoft Edge d’un appareil est plus récente que la valeur spécifiée, Microsoft Edge demeure sur la version la plus récente et ne rétrograde pas vers la version spécifiée.

Si la version spécifiée n’existe pas ou n’est pas correctement mise en forme, Microsoft Edge reste sur sa version actuelle et n’est pas mis à jour automatiquement vers les versions ultérieures.

Consultez https://go.microsoft.com/fwlink/?linkid=2136707 si vous souhaitez obtenir plus d’informations.

Cette stratégie est uniquement disponible sur les instances Windows qui sont jointes à un domaine Microsoft® Active Directory®.</string>
      <string id="Explain_RollbackToTargetVersionMicrosoftEdgeBeta">Spécifie que la mise à jour de Microsoft Edge doit rétablir les installations de Microsoft Edge vers la version indiquée dans « Remplacement de la version cible ».

Cette stratégie n’a aucun effet, sauf si « Remplacement de la version cible » est défini et que « Remplacement de la stratégie de mise à jour » est configuré sur l’un des états ACTIVÉ (Toujours autoriser les mises à jour, Mises à jour silencieuses automatiques uniquement, Mises à jour manuelles uniquement).

Si vous désactivez (0) cette stratégie ou ne la configurez pas, les installations dont la version est supérieure à celle spécifiée par « Remplacement de la version cible » sont conservées.

Si vous activez (1) cette stratégie, les installations dont la version actuelle est supérieure à celle spécifiée par « Remplacement de la version cible » seront rétrogradées à la version cible.

Nous recommandons aux utilisateurs d’installer la dernière version du navigateur Microsoft Edge afin d’être protégés par les dernières mises à jour de sécurité. La restauration vers une version antérieure représente un risque d’exposition aux problèmes de sécurité connus. Cette stratégie est destinée à être utilisée comme correctif temporaire pour résoudre les problèmes rencontrés dans une mise à jour du navigateur Microsoft Edge.

Avant de restaurer temporairement la version de votre navigateur, nous vous recommandons d’activer la synchronisation (https://go.microsoft.com/fwlink/?linkid=2133032) pour tous les utilisateurs de votre organisation. Si vous n’activez pas la synchronisation, vous risquez de perdre définitivement des données de navigation. Vous assumez donc les risques liés à l’utilisation de cette stratégie.

Note : Toutes les versions disponibles pour la restauration peuvent être consultées ici https://aka.ms/EdgeEnterprise.

Cette stratégie s’applique à la version 86 ou ultérieure de Microsoft Edge.

Pour plus d’informations, consultez l’https://go.microsoft.com/fwlink/?linkid=2133918.

Cette stratégie n’est disponible que sur les instances Windows qui sont reliées à un domaine Microsoft® Active Directory®.</string>
      <string id="Explain_EdgePolicyMicrosoftEdgeBeta">Vous permet de spécifier si les utilisateurs du Programme Windows Insider sont inscrits à Edge Preview via Microsoft Edge Update.

  - Si vous activez (1) cette stratégie, les utilisateurs du programme Windows Insider sont inscrits à Edge Preview via Microsoft Edge Update.

  - Si vous désactivez (0) cette stratégie, les utilisateurs du programme Windows Insider ne peuvent pas être inscrits à Edge Preview via Microsoft Edge Update.

  – Si vous ne configurez pas cette stratégie, les utilisateurs du Programme Windows Insider sont inscrits à Edge Preview via Microsoft Edge Update par défaut.</string>
      <string id="Explain_EdgePreviewEnrollmentTypeMicrosoftEdgeBeta">Les détails de cette stratégie seront disponibles dans une prochaine version</string>
      <string id="Explain_MeteredUpdatesPolicyMicrosoftEdgeBeta">Spécifie si la mise à jour de Microsoft Edge doit être effectuée sur les connexions identifiées comme limitées, telles que les connexions cellulaires ou d’autres connexions où l’utilisation des données est contrôlée pour le navigateur Microsoft Edge. 

Si vous n’activez pas et ne configurez pas cette stratégie, les mises à jour sont effectuées selon la bascule « Télécharger les mises à jour sur les connexions payantes » dans la page « À propos » du navigateur Microsoft Edge. Si l’utilisateur ne fait pas de choix, c’est le paramètre de Windows qui est utilisé. Pour en savoir plus sur les paramètres de Windows, cliquez ici : https://learn.microsoft.com/en-us/windows/client-management/mdm/policy-csp-update#allowautowindowsupdatedownloadovermeterednetwork

Toujours autoriser les mises à jour (2) : Les mises à jour sont toujours téléchargées lorsqu’elles sont détectées, soit par un contrôle automatique des mises à jour, soit par un contrôle manuel des mises à jour.

Désactiver les mises à jour (1) : Les mises à jour ne sont pas téléchargées lors de l’utilisation d’une connexion limitée.</string>
      <string id="Explain_UninstallEdgeMicrosoftEdgeBeta">Vous pouvez spécifier si Microsoft Edge (canal stable) est désinstallé ou s’il ne peut pas être désinstallé, sur les appareils joints à un domaine dans l’Espace économique européen (EEA).

Si cette stratégie est définie sur « Activé », Microsoft Edge est automatiquement désinstallé sur tous les appareils dans l’EEA où cette stratégie est déployée. Les données utilisateur seront conservées sur l’appareil. Microsoft Edge sera désinstallé la prochaine fois que Microsoft Edge Update recherchera automatiquement des mises à jour. Si Microsoft Edge est désinstallé des appareils, les applications, widgets (par exemple, Actualités, Recherche et Météo) ou toute autre application web progressive (PWA) qui dépend de Microsoft Edge ne seront plus disponibles.

Si cette stratégie est définie sur « Activé et supprimer des données utilisateur » (paramètre « 2 »), Microsoft Edge est automatiquement désinstallé sur tous les appareils dans l’EEA où cette stratégie est déployée et les données utilisateur sont supprimées de l’appareil.

Si cette stratégie est définie sur « Désactivé » (paramètre « 3 »), aucun utilisateur dans l’EEA ne pourra désinstaller Microsoft Edge où cette stratégie est déployée.

Si la stratégie est « Non configuré » (paramètre par défaut), le paramètre de région Windows d’un utilisateur détermine s’il peut désinstaller Microsoft Edge sur un appareil joint à un domaine. Seuls les utilisateurs des pays de l’EEA pourront désinstaller Microsoft Edge s’ils le souhaitent. Les utilisateurs extérieurs à cette zone ne pourront pas désinstaller Microsoft Edge.

Cette stratégie est disponible uniquement sur les éditions Windows Home, Pro, Pro Éducation, Pro pour Stations de travail, Enterprise, Éducation et Enterprise multi-session de Windows 10 22H2, Windows 11 23H2 et versions ultérieures.

Cette stratégie n’est disponible que sur les instances Windows qui sont reliées à un domaine Microsoft® Active Directory®.

Si Microsoft Edge doit être réinstallé :
– Vous pouvez définir la stratégie « Installer » sur Forcer les installations (à l’échelle de l’ordinateur) à réinstaller Microsoft Edge.
– Si vous définissez la stratégie d’installation sur Forcer les installations (à l’échelle de l’ordinateur) et si vous définissez également la stratégie de désinstallation sur Activé, la stratégie Forcer les installations (à l’échelle de l’ordinateur) remplace la stratégie de désinstallation.</string>
      <string id="Cat_MicrosoftEdgeDev">Microsoft Edge Dev</string>
      <string id="Explain_InstallMicrosoftEdgeDev">Spécifie si un canal Microsoft Edge peut être installé sur des appareils joints à un domaine.

  Si vous activez (1) cette stratégie pour un canal, l’installation de Microsoft Edge ne sera pas bloquée.

  Si vous désactivez (0) cette stratégie pour un canal (ou la définissez sur « Installations désactivées »), Microsoft Edge ne sera pas installée.

  Si vous ne configurez pas cette stratégie pour un canal, la configuration de stratégie « Autoriser l’installation par défaut » détermine si les utilisateurs peuvent installer ce canal de Microsoft Edge.

Si vous définissez cette stratégie sur Toujours autoriser les installations Machine-Wide mais pas les installations Per-User (4), « APP_NAME » est déployé uniquement à l’échelle de l’ordinateur.

Si vous définissez cette stratégie sur Forcer les installations (à l'échelle de la machine) (5), « APP_NAME » ne peut être déployé à l'échelle de la machine que si Microsoft Edge Update est préinstallé. Nécessite Microsoft Edge Update 1.3.155.43 ou une version plus récente.

Si vous définissez cette stratégie sur Forcer les installations (par utilisateur) (6), « APP_NAME » peut n’être déployé que sur une base par utilisateur sur toutes les machines si Microsoft Edge Update est préinstallé par utilisateur. Nécessite Microsoft Edge Update 1.3.155.43 ou une version plus récente.

Cette stratégie n’est disponible que sur les instances Windows jointes à un domaine Microsoft® Active Directory®.</string>
      <string id="Explain_AutoUpdateMicrosoftEdgeDev">Spécifie la façon dont Microsoft Edge Update gère les mises à jour disponibles à partir de Microsoft Edge.

Si vous activez cette stratégie, Microsoft Edge Update gère les mises à jour de Microsoft Edge en fonction de la configuration des options suivantes :
  - Mises à jour désactivées (0) : les mises à jour ne sont jamais appliquées.
  - Toujours autoriser les mises à jour (1) (Recommandé) : les mises à jour sont toujours appliquées lorsqu'elles sont trouvées, soit par un contrôle périodique des mises à jour, soit par un contrôle manuel des mises à jour.
  - Mises à jour manuelles uniquement (2) :les mises à jour ne sont appliquées que lorsque l'utilisateur effectue une vérification manuelle des mises à jour. (Toutes les applications ne proposent pas d’interface pour cette option.)
  - Mises à jour automatiques silencieuses uniquement (3) : Les mises à jour ne sont appliquées que lorsqu'elles sont détectées par la vérification périodique des mises à jour.

Si vous sélectionnez des mises à jour manuelles, assurez-vous de vérifier régulièrement les mises à jour en utilisant le mécanisme de mise à jour manuelle de l’application, s’il est disponible. Si vous désactivez les mises à jour, vérifiez régulièrement les mises à jour et distribuez-les aux utilisateurs.

Si vous n’activez pas et ne configurez pas cette stratégie, Microsoft Edge Update gère les mises à jour disponibles comme spécifié par la stratégie « Remplacement de la stratégie de mise à jour par défaut ».

Consultez https://go.microsoft.com/fwlink/?linkid=2136406 si vous souhaitez obtenir plus d’informations.

Cette stratégie n’est disponible que sur les instances Windows qui sont reliées à un domaine Microsoft® Active Directory®.</string>
      <string id="Explain_TargetChannelMicrosoftEdgeDev">Spécifie le canal de mise à jour de Microsoft Edge

Cette stratégie contrôle le canal de mise à jour que Microsoft Edge suivra.

Si vous activez cette stratégie, Microsoft Edge sera mis à jour vers le canal que vous configurez :
- Stable : mis à jour vers la dernière version stable.
- Bêta : mis à jour vers la dernière version bêta.
- Développeur : mis à jour vers la dernière version de développement.
– Stable étendu : mis à jour vers la dernière version stable étendue, qui suit une cadence de mise en production plus longue que stable. Pour plus d’informations, consultez https://go.microsoft.com/fwlink/?linkid=2163508.

Si vous désactivez ou ne configurez pas cette stratégie, Microsoft Edge se mettra à jour vers la dernière version disponible pour le canal par défaut.

Cette stratégie n’est prise en charge que sur les appareils Windows qui sont reliées à un domaine Microsoft® Active Directory®.</string>
      <string id="Explain_TargetVersionPrefixMicrosoftEdgeDev">Lorsque cette stratégie est activée et que la mise à jour automatique est activée,Microsoft Edge est mis à jour vers la version spécifiée par cette valeur de stratégie.

La valeur de la stratégie doit être une version spécifique de Microsoft Edge, par exemple, 83.0.499.12.

Si la version Microsoft Edge d’un appareil est plus récente que la valeur spécifiée, Microsoft Edge demeure sur la version la plus récente et ne rétrograde pas vers la version spécifiée.

Si la version spécifiée n’existe pas ou n’est pas correctement mise en forme, Microsoft Edge reste sur sa version actuelle et n’est pas mis à jour automatiquement vers les versions ultérieures.

Consultez https://go.microsoft.com/fwlink/?linkid=2136707 si vous souhaitez obtenir plus d’informations.

Cette stratégie est uniquement disponible sur les instances Windows qui sont jointes à un domaine Microsoft® Active Directory®.</string>
      <string id="Explain_RollbackToTargetVersionMicrosoftEdgeDev">Spécifie que la mise à jour de Microsoft Edge doit rétablir les installations de Microsoft Edge vers la version indiquée dans « Remplacement de la version cible ».

Cette stratégie n’a aucun effet, sauf si « Remplacement de la version cible » est défini et que « Remplacement de la stratégie de mise à jour » est configuré sur l’un des états ACTIVÉ (Toujours autoriser les mises à jour, Mises à jour silencieuses automatiques uniquement, Mises à jour manuelles uniquement).

Si vous désactivez (0) cette stratégie ou ne la configurez pas, les installations dont la version est supérieure à celle spécifiée par « Remplacement de la version cible » sont conservées.

Si vous activez (1) cette stratégie, les installations dont la version actuelle est supérieure à celle spécifiée par « Remplacement de la version cible » seront rétrogradées à la version cible.

Nous recommandons aux utilisateurs d’installer la dernière version du navigateur Microsoft Edge afin d’être protégés par les dernières mises à jour de sécurité. La restauration vers une version antérieure représente un risque d’exposition aux problèmes de sécurité connus. Cette stratégie est destinée à être utilisée comme correctif temporaire pour résoudre les problèmes rencontrés dans une mise à jour du navigateur Microsoft Edge.

Avant de restaurer temporairement la version de votre navigateur, nous vous recommandons d’activer la synchronisation (https://go.microsoft.com/fwlink/?linkid=2133032) pour tous les utilisateurs de votre organisation. Si vous n’activez pas la synchronisation, vous risquez de perdre définitivement des données de navigation. Vous assumez donc les risques liés à l’utilisation de cette stratégie.

Note : Toutes les versions disponibles pour la restauration peuvent être consultées ici https://aka.ms/EdgeEnterprise.

Cette stratégie s’applique à la version 86 ou ultérieure de Microsoft Edge.

Pour plus d’informations, consultez l’https://go.microsoft.com/fwlink/?linkid=2133918.

Cette stratégie n’est disponible que sur les instances Windows qui sont reliées à un domaine Microsoft® Active Directory®.</string>
      <string id="Explain_EdgePolicyMicrosoftEdgeDev">Vous permet de spécifier si les utilisateurs du Programme Windows Insider sont inscrits à Edge Preview via Microsoft Edge Update.

  - Si vous activez (1) cette stratégie, les utilisateurs du programme Windows Insider sont inscrits à Edge Preview via Microsoft Edge Update.

  - Si vous désactivez (0) cette stratégie, les utilisateurs du programme Windows Insider ne peuvent pas être inscrits à Edge Preview via Microsoft Edge Update.

  – Si vous ne configurez pas cette stratégie, les utilisateurs du Programme Windows Insider sont inscrits à Edge Preview via Microsoft Edge Update par défaut.</string>
      <string id="Explain_EdgePreviewEnrollmentTypeMicrosoftEdgeDev">Les détails de cette stratégie seront disponibles dans une prochaine version</string>
      <string id="Explain_MeteredUpdatesPolicyMicrosoftEdgeDev">Spécifie si la mise à jour de Microsoft Edge doit être effectuée sur les connexions identifiées comme limitées, telles que les connexions cellulaires ou d’autres connexions où l’utilisation des données est contrôlée pour le navigateur Microsoft Edge. 

Si vous n’activez pas et ne configurez pas cette stratégie, les mises à jour sont effectuées selon la bascule « Télécharger les mises à jour sur les connexions payantes » dans la page « À propos » du navigateur Microsoft Edge. Si l’utilisateur ne fait pas de choix, c’est le paramètre de Windows qui est utilisé. Pour en savoir plus sur les paramètres de Windows, cliquez ici : https://learn.microsoft.com/en-us/windows/client-management/mdm/policy-csp-update#allowautowindowsupdatedownloadovermeterednetwork

Toujours autoriser les mises à jour (2) : Les mises à jour sont toujours téléchargées lorsqu’elles sont détectées, soit par un contrôle automatique des mises à jour, soit par un contrôle manuel des mises à jour.

Désactiver les mises à jour (1) : Les mises à jour ne sont pas téléchargées lors de l’utilisation d’une connexion limitée.</string>
      <string id="Explain_UninstallEdgeMicrosoftEdgeDev">Vous pouvez spécifier si Microsoft Edge (canal stable) est désinstallé ou s’il ne peut pas être désinstallé, sur les appareils joints à un domaine dans l’Espace économique européen (EEA).

Si cette stratégie est définie sur « Activé », Microsoft Edge est automatiquement désinstallé sur tous les appareils dans l’EEA où cette stratégie est déployée. Les données utilisateur seront conservées sur l’appareil. Microsoft Edge sera désinstallé la prochaine fois que Microsoft Edge Update recherchera automatiquement des mises à jour. Si Microsoft Edge est désinstallé des appareils, les applications, widgets (par exemple, Actualités, Recherche et Météo) ou toute autre application web progressive (PWA) qui dépend de Microsoft Edge ne seront plus disponibles.

Si cette stratégie est définie sur « Activé et supprimer des données utilisateur » (paramètre « 2 »), Microsoft Edge est automatiquement désinstallé sur tous les appareils dans l’EEA où cette stratégie est déployée et les données utilisateur sont supprimées de l’appareil.

Si cette stratégie est définie sur « Désactivé » (paramètre « 3 »), aucun utilisateur dans l’EEA ne pourra désinstaller Microsoft Edge où cette stratégie est déployée.

Si la stratégie est « Non configuré » (paramètre par défaut), le paramètre de région Windows d’un utilisateur détermine s’il peut désinstaller Microsoft Edge sur un appareil joint à un domaine. Seuls les utilisateurs des pays de l’EEA pourront désinstaller Microsoft Edge s’ils le souhaitent. Les utilisateurs extérieurs à cette zone ne pourront pas désinstaller Microsoft Edge.

Cette stratégie est disponible uniquement sur les éditions Windows Home, Pro, Pro Éducation, Pro pour Stations de travail, Enterprise, Éducation et Enterprise multi-session de Windows 10 22H2, Windows 11 23H2 et versions ultérieures.

Cette stratégie n’est disponible que sur les instances Windows qui sont reliées à un domaine Microsoft® Active Directory®.

Si Microsoft Edge doit être réinstallé :
– Vous pouvez définir la stratégie « Installer » sur Forcer les installations (à l’échelle de l’ordinateur) à réinstaller Microsoft Edge.
– Si vous définissez la stratégie d’installation sur Forcer les installations (à l’échelle de l’ordinateur) et si vous définissez également la stratégie de désinstallation sur Activé, la stratégie Forcer les installations (à l’échelle de l’ordinateur) remplace la stratégie de désinstallation.</string>
      <string id="Cat_MicrosoftEdgeCanary">Microsoft Edge Canary</string>
      <string id="Explain_InstallMicrosoftEdgeCanary">Spécifie si un canal Microsoft Edge peut être installé sur des appareils joints à un domaine.

  Si vous activez (1) cette stratégie pour un canal, l’installation de Microsoft Edge ne sera pas bloquée.

  Si vous désactivez (0) cette stratégie pour un canal (ou la définissez sur « Installations désactivées »), Microsoft Edge ne sera pas installée.

  Si vous ne configurez pas cette stratégie pour un canal, la configuration de stratégie « Autoriser l’installation par défaut » détermine si les utilisateurs peuvent installer ce canal de Microsoft Edge.

Si vous définissez cette stratégie sur Forcer les installations (par utilisateur) (6), « APP_NAME » peut n’être déployé que sur une base par utilisateur sur toutes les machines si Microsoft Edge Update est préinstallé par utilisateur. Nécessite Microsoft Edge Update 1.3.155.43 ou une version plus récente.

Cette stratégie n’est disponible que sur les instances Windows jointes à un domaine Microsoft® Active Directory®.</string>
      <string id="Explain_AutoUpdateMicrosoftEdgeCanary">Spécifie la façon dont Microsoft Edge Update gère les mises à jour disponibles à partir de Microsoft Edge.

Si vous activez cette stratégie, Microsoft Edge Update gère les mises à jour de Microsoft Edge en fonction de la configuration des options suivantes :
  - Mises à jour désactivées (0) : les mises à jour ne sont jamais appliquées.
  - Toujours autoriser les mises à jour (1) (Recommandé) : les mises à jour sont toujours appliquées lorsqu'elles sont trouvées, soit par un contrôle périodique des mises à jour, soit par un contrôle manuel des mises à jour.
  - Mises à jour manuelles uniquement (2) :les mises à jour ne sont appliquées que lorsque l'utilisateur effectue une vérification manuelle des mises à jour. (Toutes les applications ne proposent pas d’interface pour cette option.)
  - Mises à jour automatiques silencieuses uniquement (3) : Les mises à jour ne sont appliquées que lorsqu'elles sont détectées par la vérification périodique des mises à jour.

Si vous sélectionnez des mises à jour manuelles, assurez-vous de vérifier régulièrement les mises à jour en utilisant le mécanisme de mise à jour manuelle de l’application, s’il est disponible. Si vous désactivez les mises à jour, vérifiez régulièrement les mises à jour et distribuez-les aux utilisateurs.

Si vous n’activez pas et ne configurez pas cette stratégie, Microsoft Edge Update gère les mises à jour disponibles comme spécifié par la stratégie « Remplacement de la stratégie de mise à jour par défaut ».

Consultez https://go.microsoft.com/fwlink/?linkid=2136406 si vous souhaitez obtenir plus d’informations.

Cette stratégie n’est disponible que sur les instances Windows qui sont reliées à un domaine Microsoft® Active Directory®.</string>
      <string id="Explain_TargetChannelMicrosoftEdgeCanary">Spécifie le canal de mise à jour de Microsoft Edge

Cette stratégie contrôle le canal de mise à jour que Microsoft Edge suivra.

Si vous activez cette stratégie, Microsoft Edge sera mis à jour vers le canal que vous configurez :
- Stable : mis à jour vers la dernière version stable.
- Bêta : mis à jour vers la dernière version bêta.
- Développeur : mis à jour vers la dernière version de développement.
– Stable étendu : mis à jour vers la dernière version stable étendue, qui suit une cadence de mise en production plus longue que stable. Pour plus d’informations, consultez https://go.microsoft.com/fwlink/?linkid=2163508.

Si vous désactivez ou ne configurez pas cette stratégie, Microsoft Edge se mettra à jour vers la dernière version disponible pour le canal par défaut.

Cette stratégie n’est prise en charge que sur les appareils Windows qui sont reliées à un domaine Microsoft® Active Directory®.</string>
      <string id="Explain_TargetVersionPrefixMicrosoftEdgeCanary">Lorsque cette stratégie est activée et que la mise à jour automatique est activée,Microsoft Edge est mis à jour vers la version spécifiée par cette valeur de stratégie.

La valeur de la stratégie doit être une version spécifique de Microsoft Edge, par exemple, 83.0.499.12.

Si la version Microsoft Edge d’un appareil est plus récente que la valeur spécifiée, Microsoft Edge demeure sur la version la plus récente et ne rétrograde pas vers la version spécifiée.

Si la version spécifiée n’existe pas ou n’est pas correctement mise en forme, Microsoft Edge reste sur sa version actuelle et n’est pas mis à jour automatiquement vers les versions ultérieures.

Consultez https://go.microsoft.com/fwlink/?linkid=2136707 si vous souhaitez obtenir plus d’informations.

Cette stratégie est uniquement disponible sur les instances Windows qui sont jointes à un domaine Microsoft® Active Directory®.</string>
      <string id="Explain_RollbackToTargetVersionMicrosoftEdgeCanary">Spécifie que la mise à jour de Microsoft Edge doit rétablir les installations de Microsoft Edge vers la version indiquée dans « Remplacement de la version cible ».

Cette stratégie n’a aucun effet, sauf si « Remplacement de la version cible » est défini et que « Remplacement de la stratégie de mise à jour » est configuré sur l’un des états ACTIVÉ (Toujours autoriser les mises à jour, Mises à jour silencieuses automatiques uniquement, Mises à jour manuelles uniquement).

Si vous désactivez (0) cette stratégie ou ne la configurez pas, les installations dont la version est supérieure à celle spécifiée par « Remplacement de la version cible » sont conservées.

Si vous activez (1) cette stratégie, les installations dont la version actuelle est supérieure à celle spécifiée par « Remplacement de la version cible » seront rétrogradées à la version cible.

Nous recommandons aux utilisateurs d’installer la dernière version du navigateur Microsoft Edge afin d’être protégés par les dernières mises à jour de sécurité. La restauration vers une version antérieure représente un risque d’exposition aux problèmes de sécurité connus. Cette stratégie est destinée à être utilisée comme correctif temporaire pour résoudre les problèmes rencontrés dans une mise à jour du navigateur Microsoft Edge.

Avant de restaurer temporairement la version de votre navigateur, nous vous recommandons d’activer la synchronisation (https://go.microsoft.com/fwlink/?linkid=2133032) pour tous les utilisateurs de votre organisation. Si vous n’activez pas la synchronisation, vous risquez de perdre définitivement des données de navigation. Vous assumez donc les risques liés à l’utilisation de cette stratégie.

Note : Toutes les versions disponibles pour la restauration peuvent être consultées ici https://aka.ms/EdgeEnterprise.

Cette stratégie s’applique à la version 86 ou ultérieure de Microsoft Edge.

Pour plus d’informations, consultez l’https://go.microsoft.com/fwlink/?linkid=2133918.

Cette stratégie n’est disponible que sur les instances Windows qui sont reliées à un domaine Microsoft® Active Directory®.</string>
      <string id="Explain_EdgePolicyMicrosoftEdgeCanary">Vous permet de spécifier si les utilisateurs du Programme Windows Insider sont inscrits à Edge Preview via Microsoft Edge Update.

  - Si vous activez (1) cette stratégie, les utilisateurs du programme Windows Insider sont inscrits à Edge Preview via Microsoft Edge Update.

  - Si vous désactivez (0) cette stratégie, les utilisateurs du programme Windows Insider ne peuvent pas être inscrits à Edge Preview via Microsoft Edge Update.

  – Si vous ne configurez pas cette stratégie, les utilisateurs du Programme Windows Insider sont inscrits à Edge Preview via Microsoft Edge Update par défaut.</string>
      <string id="Explain_EdgePreviewEnrollmentTypeMicrosoftEdgeCanary">Les détails de cette stratégie seront disponibles dans une prochaine version</string>
      <string id="Explain_MeteredUpdatesPolicyMicrosoftEdgeCanary">Spécifie si la mise à jour de Microsoft Edge doit être effectuée sur les connexions identifiées comme limitées, telles que les connexions cellulaires ou d’autres connexions où l’utilisation des données est contrôlée pour le navigateur Microsoft Edge. 

Si vous n’activez pas et ne configurez pas cette stratégie, les mises à jour sont effectuées selon la bascule « Télécharger les mises à jour sur les connexions payantes » dans la page « À propos » du navigateur Microsoft Edge. Si l’utilisateur ne fait pas de choix, c’est le paramètre de Windows qui est utilisé. Pour en savoir plus sur les paramètres de Windows, cliquez ici : https://learn.microsoft.com/en-us/windows/client-management/mdm/policy-csp-update#allowautowindowsupdatedownloadovermeterednetwork

Toujours autoriser les mises à jour (2) : Les mises à jour sont toujours téléchargées lorsqu’elles sont détectées, soit par un contrôle automatique des mises à jour, soit par un contrôle manuel des mises à jour.

Désactiver les mises à jour (1) : Les mises à jour ne sont pas téléchargées lors de l’utilisation d’une connexion limitée.</string>
      <string id="Explain_UninstallEdgeMicrosoftEdgeCanary">Vous pouvez spécifier si Microsoft Edge (canal stable) est désinstallé ou s’il ne peut pas être désinstallé, sur les appareils joints à un domaine dans l’Espace économique européen (EEA).

Si cette stratégie est définie sur « Activé », Microsoft Edge est automatiquement désinstallé sur tous les appareils dans l’EEA où cette stratégie est déployée. Les données utilisateur seront conservées sur l’appareil. Microsoft Edge sera désinstallé la prochaine fois que Microsoft Edge Update recherchera automatiquement des mises à jour. Si Microsoft Edge est désinstallé des appareils, les applications, widgets (par exemple, Actualités, Recherche et Météo) ou toute autre application web progressive (PWA) qui dépend de Microsoft Edge ne seront plus disponibles.

Si cette stratégie est définie sur « Activé et supprimer des données utilisateur » (paramètre « 2 »), Microsoft Edge est automatiquement désinstallé sur tous les appareils dans l’EEA où cette stratégie est déployée et les données utilisateur sont supprimées de l’appareil.

Si cette stratégie est définie sur « Désactivé » (paramètre « 3 »), aucun utilisateur dans l’EEA ne pourra désinstaller Microsoft Edge où cette stratégie est déployée.

Si la stratégie est « Non configuré » (paramètre par défaut), le paramètre de région Windows d’un utilisateur détermine s’il peut désinstaller Microsoft Edge sur un appareil joint à un domaine. Seuls les utilisateurs des pays de l’EEA pourront désinstaller Microsoft Edge s’ils le souhaitent. Les utilisateurs extérieurs à cette zone ne pourront pas désinstaller Microsoft Edge.

Cette stratégie est disponible uniquement sur les éditions Windows Home, Pro, Pro Éducation, Pro pour Stations de travail, Enterprise, Éducation et Enterprise multi-session de Windows 10 22H2, Windows 11 23H2 et versions ultérieures.

Cette stratégie n’est disponible que sur les instances Windows qui sont reliées à un domaine Microsoft® Active Directory®.

Si Microsoft Edge doit être réinstallé :
– Vous pouvez définir la stratégie « Installer » sur Forcer les installations (à l’échelle de l’ordinateur) à réinstaller Microsoft Edge.
– Si vous définissez la stratégie d’installation sur Forcer les installations (à l’échelle de l’ordinateur) et si vous définissez également la stratégie de désinstallation sur Activé, la stratégie Forcer les installations (à l’échelle de l’ordinateur) remplace la stratégie de désinstallation.</string>
      <string id="Cat_MicrosoftEdgeWebView">Microsoft Edge WebView</string>
      <string id="Explain_InstallMicrosoftEdgeWebView">Spécifie si un canal Microsoft Edge peut être installé sur des appareils joints à un domaine.

  Si vous activez (1) cette stratégie pour un canal, l’installation de Microsoft Edge ne sera pas bloquée.

  Si vous désactivez (0) cette stratégie pour un canal (ou la définissez sur « Installations désactivées »), Microsoft Edge ne sera pas installée.

  Si vous ne configurez pas cette stratégie pour un canal, la configuration de stratégie « Autoriser l’installation par défaut » détermine si les utilisateurs peuvent installer ce canal de Microsoft Edge.

Si vous définissez cette stratégie sur Toujours autoriser les installations Machine-Wide mais pas les installations Per-User (4), « APP_NAME » est déployé uniquement à l’échelle de l’ordinateur.

Si vous définissez cette stratégie sur Forcer les installations (à l'échelle de la machine) (5), « APP_NAME » ne peut être déployé à l'échelle de la machine que si Microsoft Edge Update est préinstallé. Nécessite Microsoft Edge Update 1.3.155.43 ou une version plus récente.

Cette stratégie n’est disponible que sur les instances Windows jointes à un domaine Microsoft® Active Directory®.</string>
      <string id="Explain_AutoUpdateMicrosoftEdgeWebView">Spécifie la façon dont Microsoft Edge Update gère les mises à jour disponibles à partir de Microsoft Edge.

Si vous activez cette stratégie, Microsoft Edge Update gère les mises à jour de Microsoft Edge en fonction de la configuration des options suivantes :
  - Mises à jour désactivées (0) : les mises à jour ne sont jamais appliquées.
  - Toujours autoriser les mises à jour (1) (Recommandé) : les mises à jour sont toujours appliquées lorsqu'elles sont trouvées, soit par un contrôle périodique des mises à jour, soit par un contrôle manuel des mises à jour.
  - Mises à jour manuelles uniquement (2) :les mises à jour ne sont appliquées que lorsque l'utilisateur effectue une vérification manuelle des mises à jour. (Toutes les applications ne proposent pas d’interface pour cette option.)
  - Mises à jour automatiques silencieuses uniquement (3) : Les mises à jour ne sont appliquées que lorsqu'elles sont détectées par la vérification périodique des mises à jour.

Si vous sélectionnez des mises à jour manuelles, assurez-vous de vérifier régulièrement les mises à jour en utilisant le mécanisme de mise à jour manuelle de l’application, s’il est disponible. Si vous désactivez les mises à jour, vérifiez régulièrement les mises à jour et distribuez-les aux utilisateurs.

Si vous n’activez pas et ne configurez pas cette stratégie, Microsoft Edge Update gère les mises à jour disponibles comme spécifié par la stratégie « Remplacement de la stratégie de mise à jour par défaut ».

Consultez https://go.microsoft.com/fwlink/?linkid=2136406 si vous souhaitez obtenir plus d’informations.

Cette stratégie n’est disponible que sur les instances Windows qui sont reliées à un domaine Microsoft® Active Directory®.</string>
      <string id="Explain_TargetChannelMicrosoftEdgeWebView">Spécifie le canal de mise à jour de Microsoft Edge

Cette stratégie contrôle le canal de mise à jour que Microsoft Edge suivra.

Si vous activez cette stratégie, Microsoft Edge sera mis à jour vers le canal que vous configurez :
- Stable : mis à jour vers la dernière version stable.
- Bêta : mis à jour vers la dernière version bêta.
- Développeur : mis à jour vers la dernière version de développement.
– Stable étendu : mis à jour vers la dernière version stable étendue, qui suit une cadence de mise en production plus longue que stable. Pour plus d’informations, consultez https://go.microsoft.com/fwlink/?linkid=2163508.

Si vous désactivez ou ne configurez pas cette stratégie, Microsoft Edge se mettra à jour vers la dernière version disponible pour le canal par défaut.

Cette stratégie n’est prise en charge que sur les appareils Windows qui sont reliées à un domaine Microsoft® Active Directory®.</string>
      <string id="Explain_TargetVersionPrefixMicrosoftEdgeWebView">Lorsque cette stratégie est activée et que la mise à jour automatique est activée,Microsoft Edge est mis à jour vers la version spécifiée par cette valeur de stratégie.

La valeur de la stratégie doit être une version spécifique de Microsoft Edge, par exemple, 83.0.499.12.

Si la version Microsoft Edge d’un appareil est plus récente que la valeur spécifiée, Microsoft Edge demeure sur la version la plus récente et ne rétrograde pas vers la version spécifiée.

Si la version spécifiée n’existe pas ou n’est pas correctement mise en forme, Microsoft Edge reste sur sa version actuelle et n’est pas mis à jour automatiquement vers les versions ultérieures.

Consultez https://go.microsoft.com/fwlink/?linkid=2136707 si vous souhaitez obtenir plus d’informations.

Cette stratégie est uniquement disponible sur les instances Windows qui sont jointes à un domaine Microsoft® Active Directory®.</string>
      <string id="Explain_RollbackToTargetVersionMicrosoftEdgeWebView">Spécifie que la mise à jour de Microsoft Edge doit rétablir les installations de Microsoft Edge vers la version indiquée dans « Remplacement de la version cible ».

Cette stratégie n’a aucun effet, sauf si « Remplacement de la version cible » est défini et que « Remplacement de la stratégie de mise à jour » est configuré sur l’un des états ACTIVÉ (Toujours autoriser les mises à jour, Mises à jour silencieuses automatiques uniquement, Mises à jour manuelles uniquement).

Si vous désactivez (0) cette stratégie ou ne la configurez pas, les installations dont la version est supérieure à celle spécifiée par « Remplacement de la version cible » sont conservées.

Si vous activez (1) cette stratégie, les installations dont la version actuelle est supérieure à celle spécifiée par « Remplacement de la version cible » seront rétrogradées à la version cible.

Nous recommandons aux utilisateurs d’installer la dernière version du navigateur Microsoft Edge afin d’être protégés par les dernières mises à jour de sécurité. La restauration vers une version antérieure représente un risque d’exposition aux problèmes de sécurité connus. Cette stratégie est destinée à être utilisée comme correctif temporaire pour résoudre les problèmes rencontrés dans une mise à jour du navigateur Microsoft Edge.

Avant de restaurer temporairement la version de votre navigateur, nous vous recommandons d’activer la synchronisation (https://go.microsoft.com/fwlink/?linkid=2133032) pour tous les utilisateurs de votre organisation. Si vous n’activez pas la synchronisation, vous risquez de perdre définitivement des données de navigation. Vous assumez donc les risques liés à l’utilisation de cette stratégie.

Note : Toutes les versions disponibles pour la restauration peuvent être consultées ici https://aka.ms/EdgeEnterprise.

Cette stratégie s’applique à la version 86 ou ultérieure de Microsoft Edge.

Pour plus d’informations, consultez l’https://go.microsoft.com/fwlink/?linkid=2133918.

Cette stratégie n’est disponible que sur les instances Windows qui sont reliées à un domaine Microsoft® Active Directory®.</string>
      <string id="Explain_EdgePolicyMicrosoftEdgeWebView">Vous permet de spécifier si les utilisateurs du Programme Windows Insider sont inscrits à Edge Preview via Microsoft Edge Update.

  - Si vous activez (1) cette stratégie, les utilisateurs du programme Windows Insider sont inscrits à Edge Preview via Microsoft Edge Update.

  - Si vous désactivez (0) cette stratégie, les utilisateurs du programme Windows Insider ne peuvent pas être inscrits à Edge Preview via Microsoft Edge Update.

  – Si vous ne configurez pas cette stratégie, les utilisateurs du Programme Windows Insider sont inscrits à Edge Preview via Microsoft Edge Update par défaut.</string>
      <string id="Explain_EdgePreviewEnrollmentTypeMicrosoftEdgeWebView">Les détails de cette stratégie seront disponibles dans une prochaine version</string>
      <string id="Explain_MeteredUpdatesPolicyMicrosoftEdgeWebView">Spécifie si la mise à jour de Microsoft Edge doit être effectuée sur les connexions identifiées comme limitées, telles que les connexions cellulaires ou d’autres connexions où l’utilisation des données est contrôlée pour le navigateur Microsoft Edge. 

Si vous n’activez pas et ne configurez pas cette stratégie, les mises à jour sont effectuées selon la bascule « Télécharger les mises à jour sur les connexions payantes » dans la page « À propos » du navigateur Microsoft Edge. Si l’utilisateur ne fait pas de choix, c’est le paramètre de Windows qui est utilisé. Pour en savoir plus sur les paramètres de Windows, cliquez ici : https://learn.microsoft.com/en-us/windows/client-management/mdm/policy-csp-update#allowautowindowsupdatedownloadovermeterednetwork

Toujours autoriser les mises à jour (2) : Les mises à jour sont toujours téléchargées lorsqu’elles sont détectées, soit par un contrôle automatique des mises à jour, soit par un contrôle manuel des mises à jour.

Désactiver les mises à jour (1) : Les mises à jour ne sont pas téléchargées lors de l’utilisation d’une connexion limitée.</string>
      <string id="Explain_UninstallEdgeMicrosoftEdgeWebView">Vous pouvez spécifier si Microsoft Edge (canal stable) est désinstallé ou s’il ne peut pas être désinstallé, sur les appareils joints à un domaine dans l’Espace économique européen (EEA).

Si cette stratégie est définie sur « Activé », Microsoft Edge est automatiquement désinstallé sur tous les appareils dans l’EEA où cette stratégie est déployée. Les données utilisateur seront conservées sur l’appareil. Microsoft Edge sera désinstallé la prochaine fois que Microsoft Edge Update recherchera automatiquement des mises à jour. Si Microsoft Edge est désinstallé des appareils, les applications, widgets (par exemple, Actualités, Recherche et Météo) ou toute autre application web progressive (PWA) qui dépend de Microsoft Edge ne seront plus disponibles.

Si cette stratégie est définie sur « Activé et supprimer des données utilisateur » (paramètre « 2 »), Microsoft Edge est automatiquement désinstallé sur tous les appareils dans l’EEA où cette stratégie est déployée et les données utilisateur sont supprimées de l’appareil.

Si cette stratégie est définie sur « Désactivé » (paramètre « 3 »), aucun utilisateur dans l’EEA ne pourra désinstaller Microsoft Edge où cette stratégie est déployée.

Si la stratégie est « Non configuré » (paramètre par défaut), le paramètre de région Windows d’un utilisateur détermine s’il peut désinstaller Microsoft Edge sur un appareil joint à un domaine. Seuls les utilisateurs des pays de l’EEA pourront désinstaller Microsoft Edge s’ils le souhaitent. Les utilisateurs extérieurs à cette zone ne pourront pas désinstaller Microsoft Edge.

Cette stratégie est disponible uniquement sur les éditions Windows Home, Pro, Pro Éducation, Pro pour Stations de travail, Enterprise, Éducation et Enterprise multi-session de Windows 10 22H2, Windows 11 23H2 et versions ultérieures.

Cette stratégie n’est disponible que sur les instances Windows qui sont reliées à un domaine Microsoft® Active Directory®.

Si Microsoft Edge doit être réinstallé :
– Vous pouvez définir la stratégie « Installer » sur Forcer les installations (à l’échelle de l’ordinateur) à réinstaller Microsoft Edge.
– Si vous définissez la stratégie d’installation sur Forcer les installations (à l’échelle de l’ordinateur) et si vous définissez également la stratégie de désinstallation sur Activé, la stratégie Forcer les installations (à l’échelle de l’ordinateur) remplace la stratégie de désinstallation.</string>
    </stringTable>
    <presentationTable>
      <presentation id="Pol_AutoUpdateCheckPeriod">
        <decimalTextBox refId="Part_AutoUpdateCheckPeriod" defaultValue="1400"
            spinStep="60">Minutes entre les vérifications de mise à jour</decimalTextBox>
      </presentation>
      <presentation id="Pol_UpdateCheckSuppressedPeriod">
        <decimalTextBox refId="Part_UpdateCheckSuppressedStartHour"
            defaultValue="0" spinStep="1">Heure</decimalTextBox>
        <decimalTextBox refId="Part_UpdateCheckSuppressedStartMin"
            defaultValue="0" spinStep="1">Minute</decimalTextBox>
        <decimalTextBox refId="Part_UpdateCheckSuppressedDurationMin"
            defaultValue="60">Durée</decimalTextBox>
      </presentation>
      <presentation id="Pol_DownloadPreference">
        <dropdownList refId="Part_DownloadPreference"
            defaultItem="0">Type d’URL de téléchargement à demander</dropdownList>
      </presentation>
      <presentation id="Pol_ProxyMode">
        <dropdownList refId="Part_ProxyMode"
            defaultItem="0">Choisir comment spécifier les paramètres d’un serveur proxy</dropdownList>
      </presentation>
      <presentation id="Pol_ProxyServer">
        <textBox refId="Part_ProxyServer">
          <label>Adresse ou URL d’un serveur proxy</label>
          <defaultValue></defaultValue>
        </textBox>
      </presentation>
      <presentation id="Pol_ProxyPacUrl">
        <textBox refId="Part_ProxyPacUrl">
          <label>URL du fichier .pac du proxy</label>
          <defaultValue></defaultValue>
        </textBox>
      </presentation>
      <presentation id="Pol_DefaultUpdatePolicy">
        <dropdownList refId="Part_UpdatePolicy"
            defaultItem="0">Stratégie de mise à jour</dropdownList>
      </presentation>
      <presentation id="Pol_UpdatePolicy">
        <dropdownList refId="Part_UpdatePolicy"
            defaultItem="0">Stratégie de mise à jour</dropdownList>
      </presentation>
      <presentation id="Pol_TargetVersionPrefix">
        <textBox refId="Part_TargetVersionPrefix">
          <label>Version cible</label>
          <defaultValue></defaultValue>
        </textBox>
      </presentation>
      <presentation id="Pol_ECSControl">
        <dropdownList refId="Part_ECSControl"
            defaultItem="1">Contrôler les communications de l’agent de mise à jour avec le service d’expérimentation et de configuration</dropdownList>
      </presentation>
      <presentation id="Pol_TargetChannel" >
        <dropdownList refId="Part_TargetChannel"
            defaultItem="0">Canal cible
        </dropdownList>
      </presentation>
      <presentation id="Pol_DefaultRemoveDesktopShortcut">
        <dropdownList refId="Part_RemoveDesktopShortcut"
            defaultItem="0"></dropdownList>
      </presentation>
      <presentation id="Pol_RemoveDesktopShortcut">
        <dropdownList refId="Part_RemoveDesktopShortcut"
            defaultItem="0"></dropdownList>
      </presentation>
      <presentation id="Pol_DefaultCreateDesktopShortcut" />
      <presentation id="Pol_CreateDesktopShortcut" />
      <presentation id="Pol_RollbackToTargetVersion" />
      <presentation id="Pol_EdgePreview" />
      <presentation id="Pol_EdgePreviewEnrollmentType">
        <dropdownList refId="Part_EdgePreviewEnrollmentType"
            defaultItem="0">Type d’inscription</dropdownList>
      </presentation>
      <presentation id="Pol_DefaultMeteredUpdates">
        <dropdownList refId="Part_DefaultMeteredUpdatesPolicy"
            defaultItem="0">Stratégie de mises à jour limitées par défaut</dropdownList>
      </presentation>
      <presentation id="Pol_MeteredUpdates">
        <dropdownList refId="Part_MeteredUpdatesPolicy"
            defaultItem="0">Stratégie de mises à jour limitées</dropdownList>
      </presentation>
      <presentation id="Pol_UninstallEdge">
        <dropdownList refId="Part_UninstallEdgePolicy"
            defaultItem="0"></dropdownList>
      </presentation>
      <presentation id="Pol_AllowSideBySideExperience" />
      <presentation id="Pol_DefaultAllowInstallation">
        <dropdownList refId="Part_InstallPolicy"
            defaultItem="0">Stratégie d’installation</dropdownList>
      </presentation>
      <presentation id="Pol_AllowInstallation">
        <dropdownList refId="Part_InstallPolicy"
            defaultItem="0">Stratégie d’installation</dropdownList>
      </presentation>

    </presentationTable>
  </resources>
</policyDefinitionResources>